<a href="https://colab.research.google.com/github/ssbyrne89/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/DSPT5_HW_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-01-22 02:32:45--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.242.238
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.242.238|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  17.0MB/s    in 13s

2020-01-22 02:32:59 (15.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [7]:
##### YOUR CODE HERE #####

import pandas as pd
import numpy as np


order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [13]:
order_products__train = order_products__train[['order_id', 'product_id']]
order_products__train[:10]

   order_id  product_id
0         1       49302
1         1       11109
2         1       10246
3         1       49683
4         1       43633
5         1       13176
6         1       47209
7         1       22035
8        36       39612
9        36       19660

In [11]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [14]:
order_products__prior = order_products__prior[['order_id', 'product_id']]
order_products__prior.sample(7)

          order_id  product_id
4590901     484600        3914
31495078   3321858        8518
29871936   3150681        9139
1117570     117938        8277
6416087     677108        9397
30194685   3185031        4210
25594605   2699253       26209

In [16]:
### now that both orders_products have been slimmed, it's time to concatenate them

order_products__merged = pd.concat([order_products__prior, order_products__train])
order_products__merged = order_products__merged.reset_index()
print(order_products__merged.shape)
order_products__merged.sample(7)

(33819106, 3)

             index  order_id  product_id
25349960  25349960   2673530       37687
5181819    5181819    546916       21137
18661835  18661835   1968525        7021
3368855    3368855    355822       45007
23999300  23999300   2531103        5077
29242719  29242719   3084113        2953
31910387  31910387   3365725       22963

In [39]:
### oops i added a duplicate index on accident

order_products__merged = order_products__merged[['order_id', 'product_id']]
order_products__merged.sort_values(by='product_id', ascending=False)

###next, i will slim down the "orders" and "products" dataframes

          order_id  product_id
21341689   2251059       49688
25910726   2732438       49688
26976789   2844538       49688
23157005   2442348       49688
8040939     848810       49688
...            ...         ...
31606978   3333710           1
11564533   1220882           1
14260280   1504888           1
6832048     721128           1
17892749   1887294           1

[33819106 rows x 2 columns]

In [40]:
order_products__merged

          order_id  product_id
0                2       33120
1                2       28985
2                2        9327
3                2       45918
4                2       30035
...            ...         ...
33819101   3421063       14233
33819102   3421063       35548
33819103   3421070       35951
33819104   3421070       16953
33819105   3421070        4724

[33819106 rows x 2 columns]

In [35]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.sample(20)

(3421083, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
426063    1807383    25588  ...                14                     6.0
1319174    151514    79282  ...                11                     7.0
1203687    358244    72356  ...                 6                     7.0
1932958   1404401   116091  ...                15                    30.0
320106    2100669    19382  ...                16                    30.0
1798118   1097591   107992  ...                19                     5.0
2787425   2896892   168090  ...                 9                    12.0
1330089   1116720    79923  ...                11                     8.0
2069121   3389976   124392  ...                18                     NaN
3416278   1070027   205906  ...                12                    20.0
2488532   2757420   149794  ...                17                    14.0
1886394   3332455   113231  ...                11                    30.0
131503     923222     7924  ...                17                     5.0
1714897    623163   102974  ...                 9                    21.0
46772     1451157     2899  ...                17                     7.0
1506237    461972    90514  ...                13                     8.0
2532129   1183714   152358  ...                16                     5.0
3226485   2943565   194507  ...                11                    11.0
600198      28029    36192  ...                15                    27.0
1448207   2419653    87021  ...                23                     2.0

[20 rows x 7 columns]

In [36]:
orders = orders[['order_id', 'user_id', 'order_number']]
orders

         order_id  user_id  order_number
0         2539329        1             1
1         2398795        1             2
2          473747        1             3
3         2254736        1             4
4          431534        1             5
...           ...      ...           ...
3421078   2266710   206209            10
3421079   1854736   206209            11
3421080    626363   206209            12
3421081   2977660   206209            13
3421082    272231   206209            14

[3421083 rows x 3 columns]

In [37]:
products = pd.read_csv('products.csv')
print(products.shape)
products

(49688, 4)

       product_id  ... department_id
0               1  ...            19
1               2  ...            13
2               3  ...             7
3               4  ...             1
4               5  ...            13
...           ...  ...           ...
49683       49684  ...             5
49684       49685  ...             1
49685       49686  ...             3
49686       49687  ...             8
49687       49688  ...            11

[49688 rows x 4 columns]

In [38]:
products = products[['product_id', 'product_name']]
products

       product_id                                       product_name
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49683       49684          Vodka, Triple Distilled, Twist of Vanilla
49684       49685                 En Croute Roast Hazelnut Cranberry
49685       49686                                   Artisan Baguette
49686       49687         Smartblend Healthy Metabolism Dry Cat Food
49687       49688                             Fresh Foaming Cleanser

[49688 rows x 2 columns]

In [42]:
# 'products' and 'orders' have been slimmed,
# i shall create a subset and set a condition to find 'products' in 'order_products__merged first
# then i shall merge the subset to the 'order_products__merge'

condition = products['product_id'].isin(order_products__merged['product_id'])

temp_products = products[condition]
print(products.shape)
temp_products

(49688, 2)

       product_id                                       product_name
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49683       49684          Vodka, Triple Distilled, Twist of Vanilla
49684       49685                 En Croute Roast Hazelnut Cranberry
49685       49686                                   Artisan Baguette
49686       49687         Smartblend Healthy Metabolism Dry Cat Food
49687       49688                             Fresh Foaming Cleanser

[49685 rows x 2 columns]

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# table2 -> tidy

In [0]:
# tidy -> table2

In [0]:
flights = sns.load_dataset('flights')

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####